#### Parent Property

---

|  |
| --- |
| Category Class   See Also |

Returns the parent category of this category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Category Parent { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Parent As Category 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Category^ Parent { 	Category^ get (); } ``` |

#### Return Value

   a null reference (  Nothing  in Visual Basic)  if this category a not a subcategory

# See Also

Category Class

Autodesk.Revit.DB Namespace